Repository: ViktorProkopenko/vmaline.ua
Catalog: www/modules/tracker/translations/modules-tracker.*.po
Languages: ru

source: !time ago
ru: !time назад

source: Last updated
ru: Обновлен(а)

source: tracker
ru: отслеживание

source: All recent content
ru: Весь последний материал

source: My recent content
ru: Мой последний материал

source: Track content
ru: Отслеживание материала

source: The Tracker module displays the most recently added and updated content on your site, and allows you to follow new content created by each user. This module has no configuration options. For more information, see the online handbook entry for <a href="@tracker">Tracker module</a>.
ru: Модуль Tracker позволяет отслеживать изменения в содержании сайта. Он показывает информацию о добавленных и обновлённых документах и о добавлении к документам комментариев. Отслеживать изменения в содержании можно не только для всего содержания сайта сразу, но и на основе пользователей. Этот модуль не имеет настраиваемых параметров. Для получения дополнительной информации смотрите онлайн справку по <a href="@tracker">Tracker модулю</a>.

source: The Tracker module adds a new menu item to the Navigation menu, called <em>Recent content</em>. You can configure menu items via the <a href="@menus">Menus administration page</a>.
ru: Модуль Tracker добавляет новый пункт в меню навигации, который называется «Новые сообщения». Настроить параметры этого пункта и его размещение можно на <a href="@menus">странице меню</a>.

source: Tracking new and updated site content
ru: Отслеживание нового и обновлённого материала сайта

source: The <a href='@recent'>Recent content</a> page shows new and updated content in reverse chronological order, listing the content type, title, author's name, number of comments, and time of last update. Content is considered updated when changes occur in the text, or when new comments are added. The <em>My recent content</em> tab limits the list to the currently logged-in user.
ru: Отслеживать новые и обновлённые документы можно на странице <a href='@recent'>новых сообщений</a>, на которых обновлённое содержание показывается в обратном хронологическом порядке. На этой странице содержится информация об обновлённом документе, характере обновления, тип документа, автор документа, количество комментариев и дата последнего обновления. Документ считается изменённым в том случае, если изменилась какая-либо информация связанная с документом или к документу был добавлен комментарий. Для пользователей, которые вошли в аккаунт, на странице новых сообщений показывается вкладка «Мои сообщения», которая позволяет ограничить список изменённых документов, которые связаны с аккаунтом текущего пользователя.

source: Tracking user-specific content
ru: Отслеживание материала конкретного пользователя

source: To follow a specific user's new and updated content, select the <em>Track</em> tab from the user's profile page.
ru: Отслеживать новые и обновлённые документы можно на странице новых сообщений, которая доступна на странице профиля пользователя и называется «История».

source: Indexed %count content items for tracking.
ru: Индексировано %count пунктов содержимого для трекинга.
