Repository: ViktorProkopenko/vmaline.ua
Catalog: www/modules/menu/translations/modules-menu.*.po
Languages: ru

source: Menus
ru: Меню

source: Add menu
ru: Добавить меню

source: Edit menu
ru: Изменить меню

source: Delete menu
ru: Удалить меню

source: Menu settings
ru: Параметры меню

source: Any customizations will be lost. This action cannot be undone.
ru: Все изменения будут потеряны. Это действие не может быть отменено.

source: menu
ru: меню

source: Menu link
ru: Ссылка в меню

source: Menu name
ru: Имя меню

source: Are you sure you want to delete the custom menu %title?
ru: Вы уверены, что хотите удалить пользовательское меню %title?

source: The custom menu %title has been deleted.
ru: Пользовательское меню %title было удалено.

source: List menus
ru: Список меню

source: Customize menu
ru: Настройка меню

source: add link
ru: Добавить ссылку

source: The menu system stores system paths only, but will use the URL alias for display. %link_path has been stored as %normal_path
ru: Система меню сохраняет только системные пути, но использует синонимы URL для показа. %link_path был сохранён как %normal_path

source: edit menu
ru: изменить меню

source: Not in menu
ru: Не в меню

source: No Main links
ru: Нет основных ссылок

source: Source for the Main links
ru: Источник для основных ссылок

source: Select what should be displayed as the Main links (typically at the top of the page).
ru: Выберите, что должно отображаться в качестве основных ссылок (обычно в верхней части страницы).

source: No Secondary links
ru: Нет дополнительных ссылок

source: Source for the Secondary links
ru: Источник для дополнительного меню

source: Select the source for the Secondary links. An advanced option allows you to use the same source for both Main links (currently %main) and Secondary links: if your source menu has two levels of hierarchy, the top level menu links will appear in the Main links, and the children of the active link will appear in the Secondary links.
ru: Определите меню, которое будет выводиться в дополнительных ссылках. Если в этом поле выбрать то же самое меню, что и для основных ссылок (в настоящее время «%main»), то в дополнительных ссылках будет выводится второй уровень для активного пункта меню основных ссылок.

source: Menu links that are not enabled will not be listed in any menu.
ru: Выключенные пункты в меню не показываются.

source: If selected and this menu link has children, the menu will always appear expanded.
ru: Если у пункта есть вложенные в него пункты, то этот пункт всегда показывается развёрнутым и вложенные в него пункты видны.

source: Parent link
ru: Родительская ссылка

source: The maximum depth for a link and all its children is fixed at !maxdepth. Some menu links may not be available as parents if selecting them would exceed this limit.
ru: Максимальная глубина вложения не может превышать !maxdepth. Пункты, которые превышают это значение, недоступны для выбора.

source: Add link
ru: Добавить ссылку

source: Edit menu link
ru: Редактировать ссылку меню

source: Reset menu link
ru: Сбросить ссылки меню

source: Delete menu link
ru: Удалить ссылку меню

source: Add new menus to your site, edit existing menus, and rename and reorganize menu links.
ru: Добавление новых меню, правка существующих, переименование и переупорядочивание ссылок меню.

source: The text to be used for this link in the menu.
ru: Текст, используемый для данной ссылки меню.

source: The path for this menu link. This can be an internal Drupal path such as %add-node or an external URL such as %drupal. Enter %front to link to the front page.
ru: Адрес, на который будет вести пункт меню. Для указания ссылки на внутреннюю страницу сайта, используйте относительный путь, пример: %add-node. Для создания внешних ссылок, используйте абсолютный адрес, пример: %drupal. Чтобы ссылка вела на первую страницу сайта, введите %front.

source: Optional. In the menu, the heavier links will sink and the lighter links will be positioned nearer the top.
ru: Пункты меню упорядочиваются сначала по весу, а затем по названию.

source: Are you sure you want to delete the custom menu link %item?
ru: Удаление пункта «%item»

source: The menu link %title has been deleted.
ru: Ссылка «%title» удалена.

source: Are you sure you want to reset the link %item to its default values?
ru: Вы уверены, что хотите вернуть ссылке %item её значение по умолчанию?

source: The menu link was reset to its default settings.
ru: Ссылки меню были сброшены к настройкам по умолчанию.

source: Deleted custom menu %title and all its menu links.
ru: удаление пользовательского меню %title и всех его ссылок.

source: Deleted menu link %title.
ru: Удалить ссылку меню %title.

source: <strong>Warning:</strong> There is currently 1 menu link in %title. It will be deleted (system-defined items will be reset).
ru: <strong>Внимание:</strong> В %title в настоящий момент 1 ссылка меню. Она будет удалена (будут установлены определенные системой пункты).

source: There are no menu links yet. <a href="@link">Add link</a>.
ru: Ссылок меню нет. <a href="@link">Добавить ссылку</a>.

source: Show as expanded
ru: Показывать раскрытым

source: Available menus
ru: Доступные меню

source: The menus available to place links in for this content type.
ru: Доступные меню для расположения ссылок на этот тип содержимого.

source: Default parent item
ru: Родительский элемент по умолчанию

source: Choose the menu item to be the default parent for a new link in the content authoring form.
ru: Выберите элемент меню, который будет родителем для новой ссылки в содержимом формы автора.

source: Parent menu items
ru: Родитель пункта меню

source: Provide a menu link
ru: Добавить ссылку в меню

source: Menu links with smaller weights are displayed before links with larger weights.
ru: Ссылки меню с более легким весом "всплывают" над ссылками более тяжелыми.

source: Managing menus
ru: Управление меню

source: Displaying menus
ru: Показ меню

source: After you have created a menu, you must enable and position the associated block on the <a href="@blocks">Blocks administration page</a>.
ru: После того как вы добавляете на сайт меню, вы <a href="@blocks">можете разместить</a> его блок в нужном регионе и определить для этого блока нужные параметры вывода.

source: Your configuration has been saved.
ru: Ваша конфигурация была сохранена.

source: Administer menus and menu items
ru: Управление меню и пунктами меню

source: Users with the <em>Administer menus and menu items</em> permission can add, edit and delete custom menus on the <a href="@menu">Menus administration page</a>. Custom menus can be special site menus, menus of external links, or any combination of internal and external links. You may create an unlimited number of additional menus, each of which will automatically have an associated block. By selecting <em>list links</em>, you can add, edit, or delete links for a given menu. The links listing page provides a drag-and-drop interface for controlling the order of links, and creating a hierarchy within the menu.
ru: Пользователи с правом «Управление меню» могут добавлять, редактировать и удалять меню сайта на <a href="@menu">странице меню</a>. Можно добавить меню, которое будет содержать ссылки для навигации по документам определённой темы, меню содержащее внешние ссылки или комбинировать в одном меню внутренние и внешние ссылки. Можно добавить неограниченное количество дополнительных меню, для каждого из которых будет создан связанные с этим меню блок. Страница со списком ссылок в меню позволяет настраивать отдельные ссылки и управлять общим порядком всех ссылок и упорядочивать ссылки меню в иерархию.

source: You can enable the newly-created block for this menu on the <a href="@blocks">Blocks administration page</a>.
ru: После добавления меню, не забудьте <a href="@blocks">разместить его блок</a> в каком-либо регионе!

source: Each menu has a corresponding block that is managed on the <a href="@blocks">Blocks administration page</a>.
ru: Каждое меню имеет связанный с ним блок, которой позволяет вывести меню в каком-либо регионе темы. Блоки связанные с меню располагаются на общей <a href="@blocks">странице блоков</a>. Добавление меню приведёт одновременно и к добавлению блока этого меню.

source: The <em>Navigation</em> menu contains links intended for site visitors. Links are added to the <em>Navigation</em> menu automatically by some modules.
ru: Меню навигации создаётся системой и содержит ссылки, который тесно связаны с правами пользователей. Обычно это меню является главным для навигации по сайту.

source: The <em>User</em> menu contains links related to the user's account, as well as the 'Log out' link.
ru: Меню пользователя содержит ссылки, которые связаны с аккаунтом текущего пользователя. Например, такие ссылки как «Мой аккаунт» или «Выход».

source: The <em>Management</em> menu contains links for administrative tasks.
ru: Меню управления содержит ссылки, которые предназначены для выполнения задач по управлению сайтом.

source: The <em>Main</em> menu is used on many sites to show the major sections of the site, often in a top navigation bar.
ru: Основные ссылки обычно используются для определения разделов сайта и выводятся как горизонтальная полоска вверху страницы.

source: The menu module allows on-the-fly creation of menu links in the content authoring forms. To configure these settings for a particular content type, visit the <a href="@content-types">Content types</a> page, click the <em>edit</em> link for the content type, and go to the <em>Menu settings</em> section.
ru: Добавлять пункты в меню можно прямо на странице редактирования документа. Меню, которое будет использоваться на странице редактирования документа по умолчанию, можно определить для каждого <a href="@content-types">типа документа</a> отдельно.

source: A unique name to construct the URL for the menu. It must only contain lowercase letters, numbers and hyphens.
ru: Системное название меню. Текст этого поля будет использоваться для создания URL меню. Название может содержать только латинские буквы нижнего регистра, цифры и дефис.

source: Enable @title menu link
ru: Разрешить ссылку в меню @title

source: logged in users only
ru: только зарегистрированным пользователям
