Repository: ViktorProkopenko/vmaline.ua
Catalog: www/modules/field/modules/list/translations/modules-field-modules-list.*.po
Languages: ru

source: Allowed values list
ru: Список допустимых значений

source: Key
ru: Ключ

source: Boolean
ru: Логический

source: For a 'single on/off checkbox' widget, define the 'off' value first, then the 'on' value in the <strong>Allowed values</strong> section. Note that the checkbox will be labeled with the label of the 'on' value.
ru: Для типа виджета "выключатель да/нет" в списке <strong>Допустимых значений</strong> сперва укажите значение для варианта "нет"(флажок снят), затем - для варианта "да" (флажок включён). Имейте в виду, что подпись к флажку будет взята из варианта "да".

source: This field stores simple on/off or yes/no options.
ru: Это поле сохраняет простые "вкл/выкл" или "да/нет" опции.

source: List (text)
ru: Список (текст)

source: The 'checkboxes/radio buttons' widget will display checkboxes if the <em>Number of values</em> option is greater than 1 for this field, otherwise radios will be displayed.
ru: Если количество доступных для выбора значений этого поля будет больше одного, то будут использоваться флажки. Если в этом поле можно выбрать только одно значение, то будут использоваться радиокнопки.

source: Allowed HTML tags in labels: @tags
ru: Разрешённые в метках HTML-теги: @tags

source: The value of this field is being determined by the %function function and may not be changed.
ru: Значение этого поля определяется функцией %function и не может быть изменено.

source: Allowed values list: each key must be a valid integer or decimal.
ru: Список допустимых значений: каждый ключ должен быть целым или десятичным числом.

source: Allowed values list: keys must be integers.
ru: Список допустимых значений: ключи должны быть целочисленными

source: The List module defines various fields for storing a list of items, for use with the Field module. Usually these items are entered through a select list, checkboxes, or radio buttons. See the <a href="@field-help">Field module help page</a> for more information about fields.
ru: Модуль List определяет различные поля для хранения списка пунктов используемых с модулем <a href='@field-help'>Field</a>. Обычно эти пункты вводятся через список выбора, флажки или радиокнопки.

source: Allowed values list: each key must be a string at most 255 characters long.
ru: Список допустимых значений: каждый ключ должен быть строкой из не более 255 символов.

source: On value
ru: Значение

source: If left empty, "1" will be used.
ru: Если поле оставить незаполненным, то будет использоваться значение по умолчанию: <em>1</em>.

source: Off value
ru: Значение «Выключить»

source: If left empty, "0" will be used.
ru: Если поле оставить незаполненным, то будет использоваться значение по умолчанию: <em>0</em>.

source: The possible values this field can contain. Enter one value per line, in the format key|label.
ru: Возможные значения этого поля могут содержать. Введите одно значение в каждой строке, в формате ключ|метка.

source: The key is the stored value, and must be numeric. The label will be used in displayed values and edit forms.
ru: Ключ хранится значение, и оно должно быть числовым. Метка будет использоваться в отображаемых значениях и в редактируемых формах.

source: The label is optional: if a line contains a single number, it will be used as key and label.
ru: Метка не является обязательным: если строка содержит одно число, оно будет использоваться в качестве ключа и метка.

source: Lists of labels are also accepted (one label per line), only if the field does not hold any values yet. Numeric keys will be automatically generated from the positions in the list.
ru: Список меток также принимается (одна метка в строку), только если поле не имеет никакого значения. Числовые ключи будут автоматически сгенерированы из позиции в списке.

source: The key is the stored value. The label will be used in displayed values and edit forms.
ru: Ключ хранится значение. Метка будет использоваться в отображаемых значениях и в редактировании формы.

source: The label is optional: if a line contains a single string, it will be used as key and label.
ru: Этикетка не является обязательным: если строка содержит одну строку, она будет использоваться в качестве ключа и метки.

source: List (integer)
ru: Список (целое)

source: This field stores integer values from a list of allowed 'value => label' pairs, i.e. 'Lifetime in days': 1 => 1 day, 7 => 1 week, 31 => 1 month.
ru: Это поле сохраняет целое значение в списке доступных 'value => label' пары, например 'время в днях': 1 => 1 день, 7 => 1 неделя, 31 => 1 месяц.

source: List (float)
ru: Список (плавающее)

source: This field stores float values from a list of allowed 'value => label' pairs, i.e. 'Fraction': 0 => 0, .25 => 1/4, .75 => 3/4, 1 => 1.
ru: Это поле хранит плавающее значения из списка разрешенных 'значение => метка' пар 'Доля' : 0 => 0, 0,25 => 1/4, .75 => 3/4, 1 => 1.

source: This field stores text values from a list of allowed 'value => label' pairs, i.e. 'US States': IL => Illinois, IA => Iowa, IN => Indiana.
ru: Это поле хранит текстовые значения из списка разрешенных 'значение => метка' пары, т.е. 'Штаты США: IL => Иллинойс, IA => Айова, IN => Индиана.

source: Allowed values list: invalid input.
ru: Список разрешенных значений: неверный ввод.

source: Allowed values list: some values are being removed while currently in use.
ru: Список допустимых значение: некоторые значения были удалены, в то время как они использовались.
